<a href="https://colab.research.google.com/github/Aswathyvsajeev/Datascience-libraries/blob/main/DataScience_Pandas_Library.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [5]:
#creating a pandas Series object 
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
# creating a pandas series with labelled index
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
ser1 = pd.Series([1,2,3,4],['usa','germany','ussr','japan'])
ser1

usa        1
germany    2
ussr       3
japan      4
dtype: int64

In [9]:
ser2 = pd.Series([1,2,5,4],['usa','germany','italy','japan'])
ser2
print(ser2['usa'])

1

In [10]:
ser1 + ser2

germany    4.0
italy      NaN
japan      8.0
usa        2.0
ussr       NaN
dtype: float64

In [11]:
# creating data frame with DatFrame constructor and data is hard-coded
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
# Data frame is a bunch of series that share the same index
print(type(df))
print(type(df['W']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [12]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [14]:
# Add a new column to the data frame
df['NEW'] = df['W']+df['Y']
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [15]:
df.drop('Z',axis=1,inplace=True)
df

          W         X         Y       NEW
A  2.706850  0.628133  0.907969  3.614819
B  0.651118 -0.319318 -0.848077 -0.196959
C -2.018168  0.740122  0.528813 -1.489355
D  0.188695 -0.758872 -0.933237 -0.744542
E  0.190794  1.978757  2.605967  2.796762

In [16]:
df.drop('E',inplace=True)

In [17]:
# Selecting Rows 
print(df.loc['A'])
print(df.iloc[3])

W      2.706850
X      0.628133
Y      0.907969
NEW    3.614819
Name: A, dtype: float64
W      0.188695
X     -0.758872
Y     -0.933237
NEW   -0.744542
Name: D, dtype: float64

In [18]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [19]:
#Conditional Selection 
df[df>0]

          W         X         Y       NEW
A  2.706850  0.628133  0.907969  3.614819
B  0.651118       NaN       NaN       NaN
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN       NaN

In [20]:
df['W'] >0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [21]:
df[df['W'] >0]['W']

A    2.706850
B    0.651118
D    0.188695
Name: W, dtype: float64

In [22]:
#Let's break the above step 
boolser = df['W'] >0
result = df[boolser]
result[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [23]:
df[(df['W']>0) & (df['Y']>0)]

         W         X         Y       NEW
A  2.70685  0.628133  0.907969  3.614819

In [24]:
df

          W         X         Y       NEW
A  2.706850  0.628133  0.907969  3.614819
B  0.651118 -0.319318 -0.848077 -0.196959
C -2.018168  0.740122  0.528813 -1.489355
D  0.188695 -0.758872 -0.933237 -0.744542

In [26]:
newind = 'CA NY WY  OR '.split()
df['states'] = newind

In [27]:
df

          W         X         Y       NEW states
A  2.706850  0.628133  0.907969  3.614819     CA
B  0.651118 -0.319318 -0.848077 -0.196959     NY
C -2.018168  0.740122  0.528813 -1.489355     WY
D  0.188695 -0.758872 -0.933237 -0.744542     OR

In [28]:
#setting new index for the dataframe
df.set_index('states')

               W         X         Y       NEW
states
CA      2.706850  0.628133  0.907969  3.614819
NY      0.651118 -0.319318 -0.848077 -0.196959
WY     -2.018168  0.740122  0.528813 -1.489355
OR      0.188695 -0.758872 -0.933237 -0.744542

In [29]:
df

          W         X         Y       NEW states
A  2.706850  0.628133  0.907969  3.614819     CA
B  0.651118 -0.319318 -0.848077 -0.196959     NY
C -2.018168  0.740122  0.528813 -1.489355     WY
D  0.188695 -0.758872 -0.933237 -0.744542     OR

In [30]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [32]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
# Drop the rows with null value
df.dropna()